Revit 2024 API
Dimension.HasOneSegment Method
 Determines whether a dimension has one segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public bool HasOneSegment()
Visual Basic
Public Function HasOneSegment As Boolean
Visual C++
public:
bool HasOneSegment()
See Also
Dimension Class
Autodesk.Revit.DB Namespace